console.log ('number' + 3 + 3);  //буде виведено "number33". Спочатку 3 перетворюється в рядок і відбувається конкатенація
//  з "number", потім до отриманого рядка додається ще один 3, який також перетворюється в рядок.
console.log (null + 3) // буде виведено 3. null перетворюється в 0 при додаванні з числом.
console.log (5 && "qwerty") //

+'40' + +'2' + "hillel";

'10' - 5 === 6;

true + false

'4px' - 3

'4' - 3

'6' + 3 ** 0;

12 / '6'

'10' + (5 === 6);

null == ''

3 ** (9 / 3);

!!'false' == !!'true'

0 || '0' && 1

(+null == false) < 1;

false && true || true

false && (false || true);

(+null == false) < 1 ** 5;