console.log ('number' + 3 + 3);  //буде виведено "number33". Спочатку 3 перетворюється в рядок і відбувається конкатенація
//  з "number", потім до отриманого рядка додається ще один 3, який також перетворюється в рядок.
console.log (null + 3) // буде виведено 3. null перетворюється в 0 при додаванні з числом.
console.log (5 && "qwerty") //буде виведено "qwerty". Оператор && повертає останнє істинне значення, якщо всі операнди істинні.
Сonsole.log (+'40' + +'2' + "hillel") // буде виведено "42hillel". + перетворює рядки '40' і '2'в числа 40 і 2,;
//"hillel" - це сторка , тому відбувається конкатенація з числом 42.
console.log ('10' - 5 === 6) // буде виведено false. '10' перетворюється в число 10, 10 - 5 дорівнює 5, що не дорівнює 6.;

console.log (true + false) // буде виведено 1. true перетворюється в 1, false в 0, 1 + 0 дорівнює 1.

console.log ('4px' - 3) // буде виведено NaN. '4px' не може бути коректно перетворено в число, тому результатом буде NaN.

console.log ('4' - 3) // буде виведено 1. '4' перетворюється в число 4, 4 - 3 дорівнює 1.

console.log ('6' + 3 ** 0); //буде виведено 61. 3 ** 0 дорівнює 1, '6' + 1 призводить до конкатенації рядків.

Сonsole.log (12 / '6'); // буде виведено 2. '6' перетворюється в число 6, 12 / 6 дорівнює 2.

console.log ('10' + (5 === 6)); // буде виведено 10. 5 === 6 повертає false, який перетворюється в рядок при конкатенації з '10'.

console.log (null == ''); //буде true. тому що пустий рядок і null приводяться до false, тому вони рівні при нестрогому порівнянні.

console.log (3 ** (9 / 3)); // буде виведено 27. 9 / 3 дорівнює 3, 3 ** 3 дорівнює 27.

console.log (!!'false' == !!'true'); // буде виведено true. 'false'- це непусте значення, тому !!'false' дорівнює true,
//  так само і !!'true' дорівнює true.

console.log (0 || '0' && 1); //буде виведено 1. цикл перевірки "або" - виходимо, як тільки знайшли хоч один true. '0' && 1 повертає 1.

console.log (+null == false) < 1; // буде виведено false. +null перетворює null в 0, 0 == false повертає true, aле true < 1 повертає false.

console.log (false && true || true); //буде виведено false. && - повертає true, якщо обидва операнди є true, інакше повертає false.

false && (false || true); // буде виведено false. && - повертає true, якщо обидва операнди є true, інакше повертає false. 
// || - повертає true, якщо хоча б один з операндів є true. тобто false && ( true) = false

(+null == false) < 1 ** 5; //буде виведено false. +null перетворює null в 0, 0 == false повертає true, aле true < 1 повертає false.